/** @type [string[], number][] */
const NUMBER_MATCHERS = [
    [['ноль', 'нуль'], 0],
    [['один', 'одну', 'первого'], 1],
    [['полтора', 'полторы'], 1.5],
    [['два', 'две', 'пару', 'второго'], 2],
    [['три', 'несколько', 'третьего'], 3],
    [['четыре', 'четвертого'], 4],
    [['пять', 'пятого'], 5],
    [['шесть', 'шестого'], 6],
    [['семь', 'седьмого'], 7],
    [['восемь', 'восьмого'], 8],
    [['девять', 'девятого'], 9],
    [['десять', 'десятого'], 10],
    [['одиннадцать', 'одиннадцатого'], 11],
    [['двенадцать', 'двенадцатого'], 12],
    [['тринадцать', 'тринадцатого'], 13],
    [['четырнадцать', 'четырнадцатого'], 14],
    [['пятнадцать', 'пятнадцатого'], 15],
    [['шестнадцать', 'шестнадцатого'], 16],
    [['семнадцать', 'семнадцатого'], 17],
    [['восемнадцать', 'восемнадцатого'], 18],
    [['девятнадцать', 'девятнадцатого'], 19],
    [['двадцать', 'двадцатого'], 20],
    [['тридцать', 'тридцатого'], 30],
    [['сорок', 'сорокового'], 40],
    [['пятьдесят', 'пятьдесятого'], 50],
    [['шестьдесят', 'шестьдесятого'], 60],
    [['семьдесят', 'семидесятого'], 70],
    [['восемьдесят', 'восьмидесятого'], 80],
    [['девяносто', 'девяностого'], 90],
    [['сто', 'сотня', 'сотни', 'сотню', 'сотен'], 100],
    [['двести', 'двести', 'двухсотого'], 200],
    [['триста', 'трехсотого', 'трёхсотого'], 300],
    [['четыреста', 'четырехсотого', 'четырёхсотого'], 400],
    [['пятьсот', 'пятисотого'], 500],
    [['шестьсот', 'шестисотого'], 600],
    [['семьсот', 'семисотого'], 700],
    [['восемьсот', 'восьмисотого'], 800],
    [['девятьсот', 'девятисотого'], 900],
    [['тысяч', 'тысяча', 'тысячи', 'тысячу', 'тысячного'], 1000],
];

export class RussianNumberParser {
    parse(value) {
        if (typeof value !== 'string' || value.length === 0) {
            return null;
        }

        if (!Number.isNaN(Number(value))) {
            return Number(value);
        }

        const parts = value.split(' ');

        let sign = 1;
        if (parts[0] === 'минус') {
            sign = -1;
            parts.shift();
        }

        let largestNumber = 0;
        let result = 0;
        let glue = false;

        for (const part of parts) {
            if (part === 'и') {
                glue = true;
                continue;
            }

            const match = NUMBER_MATCHERS.find(([values]) => values.includes(part));
            if (!match) {
                return null;
            }

            const number = Number(match[1]);

            if (number >= largestNumber) {
                if (glue) return null;
                if (result === 0) result = 1;

                result *= number;
                largestNumber = number;
            } else {
                result += number;
            }
        }

        return sign * result;
    }
}
